#include <iostream>
using namespace std;
int main () {

    // Вложенный цикл
    for (int i = 0; i < 7; i++)// Столбцы
    {
        for (int j = 0; j < 10; j++)// Строки
        {
            cout << "|###|";
        }
        cout << endl;
    }
    cout << endl;
    cout << "------------------------------------------------------------------------------";
    cout << endl;
    // Пример 1: Таблица умнодения 10x10
    for (int i = 0; i < 10; i++)// Столбцы
    {
        for (int j = 0; j < 10; j++)// Строки
        {
            cout << i * j << "\t";
        }
        cout << "\n\n";
    }
    cout << endl;
    cout << "------------------------------------------------------------------------------";
    cout << endl;
    // Пример 2: Вывести прямоугольник из * 20x20
    int str=1, star_count, lenght = 20;
    while (str <= lenght)
    {
        star_count = 1;
        while (star_count <= lenght)
        {
            /* code */
            cout << "*";
            star_count++;
        }
        cout << "\n";
        str++;
    }
    cout << "\n";
    cout << endl;
    cout << "------------------------------------------------------------------------------";
    cout << endl;
    // Пример 3: Как менять таблицу внутри
    // Главная диагональ
    for (int i = 0; i < 4; i++)// Столбцы
    {
        for (int j = 0; j < 4; j++)// Строки
        {
            //cout << "+";
            if (i==j)
            {
                /* code */
                cout << "+";
            } else {
                cout << "=";
            }
            
        }
        cout << "\n";
    }
    cout << endl;
    cout << "------------------------------------------------------------------------------";
    cout << endl;
    // Побочная диагональ
    int n =4;
    for (int i = 0; i < 4; i++)// Столбцы
    {
        for (int j = 0; j < 4; j++)// Строки
        {
            //cout << "+";
            if (i+j == n-1)
            {
                /* code */
                cout << "+";
            } else {
                cout << "=";
            }
            
        }
        cout << "\n";
    }
    cout << endl;
    cout << "------------------------------------------------------------------------------";
    cout << endl;
    // Пример 4: Типа домик
    for (int i = 0; i < 15; i++)// Столбцы
    {
        for (int j = 0; j < 15; j++)// Строки
        {
            if (i+j >= 14 && i>=j) {
                cout << "|===|";
            } else {
                cout << "     ";
            }
            //cout << "|===|"; Область под главной диагональю и под побочной диагональю
        }
        cout << endl;
        
    }
    cout << endl;


    for (int i = 0; i < 7; i++)// Столбцы
    {
        for (int j = 0; j < 15; j++)// Строки
        {
            cout << "|###|";
        }
        cout << endl;
    }
    cout << endl;
    cout << "------------------------------------------------------------------------------";
    cout << endl;
    return 0;
}