#include <iostream>
using namespace std;
int main() {
    // Задание 1:
    //Напишите программу, которая создает двухмерный массив и заполняет его по следующему принципу:
    //пользователь вводит число (например, 3) первый элемент
    //массива принимает значение этого числа, последующий элемент массива принимает значение этого числа
    //умноженного на 2 (т.е. 6 для нашего примера), третий
    //элемент массива предыдущий элемент умноженный на
    //2 (т.е. 6*2=12 для нашего примера). Созданный массив
    //вывести на экран.
    const int n = 3;
    const int m = 4;
    int mr[n][m];
    int s;
    cout << "Введите число: ";
    cin >> s;
    mr[0][0] = s;
    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < m; j++)
        {
            if (i == 0 && j == 0) {
                continue;
            }
            if (j == 0) {
                mr[i][j] = mr[i-1][m-1] * 2;
            } else {
                mr[i][j] = mr[i][j-1] * 2;
            }
        }
    }
    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < m; j++)
        {
            cout << mr[i][j] << "\t";
        }
        cout << endl;
    }
    cout << "\n\n";

    // Задание 2:
    //Напишите программу, которая создает двухмерный массив и заполняет его по следующему принципу:
    //пользователь вводит число (например, 3) первый элемент
    //массива принимает значение этого числа, последующий
    //элемент массива принимает значение этого числа + 1 (т.е.
    //4 для нашего примера), третий элемент массива предыдущий элемент + 1 (т.е. 5 для нашего примера). Созданный
    //массив вывести на экран.
    const int n_2 = 3;
    const int m_2 = 4;
    int mr_2[n_2][m_2];
    int s_2;
    cout << "Введите число: ";
    cin >> s_2;
    mr_2[0][0] = s_2;
    for (int i = 0; i < n_2; i++)
    {
        for (int j = 0; j < m_2; j++)
        {
            if (i == 0 && j == 0) {
                continue;
            }
            if (j == 0) {
                mr_2[i][j] = mr_2[i-1][m_2-1] + 1;
            } else {
                mr_2[i][j] = mr_2[i][j-1] + 1;
            }
        }
    }
    for (int i = 0; i < n_2; i++)
    {
        for (int j = 0; j < m_2; j++)
        {
            cout << mr_2[i][j] << "\t";
        }
        cout << endl;
    }
    cout << "\n\n";

    // Здание 3:
    //Создайте двухмерный массив. Заполните его
    //случайными числами и покажите на экран. Пользователь
    //выбирает количество сдвигов и положение (влево, вправо, вверх, вниз). Выполнить сдвиг массива и показать на
    //экран полученный результат. Сдвиг циклический. 
    const int n_3 = 3;
    const int m_3 = 4;
    int mr_3[n_3][m_3];
    srand(time(0));
    cout << "Исходный массив:" << endl;
    for (int i = 0; i < n_3; i++) {
        for (int j = 0; j < m_3; j++) {
            mr_3[i][j] = rand() % 10;
            cout << mr_3[i][j] << "\t";
        }
        cout << endl;
    }
    int shift;
    string direction;
    cout << "\nВведите количество сдвигов: ";
    cin >> shift;
    cout << "Введите направление (влево / вправо / вверх / вниз): ";
    cin >> direction;
    int result[n_3][m_3];

    if (direction == "вправо") {
        for (int i = 0; i < n_3; i++) {
            for (int j = 0; j < m_3; j++) {
                result[i][(j + shift) % m_3] = mr_3[i][j];
            }
        }
    } 
    else if (direction == "влево") {
        for (int i = 0; i < n_3; i++) {
            for (int j = 0; j < m_3; j++) {
                result[i][(j - shift + m_3) % m_3] = mr_3[i][j];
            }
        }
    } 
    else if (direction == "вниз") {
        for (int i = 0; i < n_3; i++) {
            for (int j = 0; j < m_3; j++) {
                result[(i + shift) % n_3][j] = mr_3[i][j];
            }
        }
    } 
    else if (direction == "вверх") {
        for (int i = 0; i < n_3; i++) {
            for (int j = 0; j < m_3; j++) {
                result[(i - shift + n_3) % n_3][j] = mr_3[i][j];
            }
        }
    } 
    else {
        cout << "Ошибка!" << endl;
        return 0;
    }

    cout << "\nМассив после сдвига (" << direction << " на " << shift << "):" << endl;
    for (int i = 0; i < n_3; i++) {
        for (int j = 0; j < m_3; j++) {
            cout << result[i][j] << "\t";
        }
        cout << endl;
    }

    return 0;
}